{
  "blogs": [
    {
      "title": "Earth Day 2022: 7 Things You Can Do To Celebrate Earth Day",
      "body": "The first Earth Day was initiated in 1970 during a modern environmental movement.\n\nPrior to the first Earth Day, Americans were exerting a mass amount of leaded gas due to inefficient automobiles. There were no consequences from the law or media because air pollution was accepted as a byproduct of economic growth. Many Americans were unaware of environmental concerns and damages of various types of pollution and how a polluted Earth impacts human health.\n\nThat said, things changed for the better with the publication of Rachel Carson’s New York Times bestseller Silent Spring in 1962. The book raised public awareness and concern for living organisms and the environment and the direct impact of pollution of public health. Earth Day would then emerge from the growing public awareness on pollution and provide a voice for environmental consciousness and environmental concerns.\nWHAT WOULD WE DO ON EARTH DAY?\nThe best way to celebrate Earth Day is by engaging in actions that advocate for the environment and help our beautiful planet. Here are 15 things you can do on Earth Day.\n\nADVOCATE ENVIRONMENTALISM\nShare your passion about environmentalism with your peers and families. Educate others about the importance of recycling, using less plastic , and reducing our carbon footprint. You can also support social enterprises such as Sea Smart, a social impact organization that empowers youth, businesses, teachers, and communities to take action to save our oceans. You can volunteer at our shoreline pickup, bring your children to our after school programs in Vancouver, or donate. Your support will help us protect the environment and save our oceans.\n\nUSE REUSABLE BAGS\nSingle-use plastic bags are detrimental to our environment and oceans. If single-use plastic bags aren’t recycled and end up in the ocean or wilderness, they will be ingested by animals . Human life is also harmed as a result of this consumption because we live in a tightly knitted ecosystem and food chain. Humans ultimately ingest that plastic when we consume microplastics that are present in our seafood.\n\nBy using reusable bags, we can limit our use of single-use plastics.\n\nUSE A REFILLABLE WATER BOTTLE OR MUG\nSimilar to single-use plastic bags, plastic bottles are also a major contributor of plastic waste in the world. You can help reduce plastic waste by bringing a refillable water bottle or mug with you when you go to the gym or coffee shop.\n\nSHOP FOR ECO-FRIENDLY CLOTHES\nWe can preserve our ocean by buying eco-friendly clothes made of low-impact dyes, upcycled natural materials, and organic cotton. These types of clothes are eco-friendly because they have minimal impact on our environment during the production process. For example, low impact dyes don’t contain toxic chemicals or mordants. This means that when they are washed , the clothing dye that goes into the water system won’t contaminate our waterways and harm marine life.\n\nRIDE YOUR BICYCLE FOR TRANSPORTATION\nRiding a bicycle is a healthy transportation option that minimizes our carbon footprint. And it can be fun!\n\nTAKE PUBLIC TRANSPORTATION OR CARPOOL\nIf riding your bicycle to run errands or to the office isn’t a realistic transportation method, take public transportation to reduce carbon emissions. Carpooling with coworkers or friends is also a simple and great way to reduce our carbon footprint.\n\nBUY LOCAL PRODUCE\nBuying local fruits and vegetables is beneficial for our environment. By buying local produce, we are purchasing fruits and vegetables that aren’t shipped from far away. Doing this helps reduce fossil fuel consumption, carbon emissions, and overall pollution.\n\nEarth Day is one of the most important days of the year because it celebrates environmentalism. By acknowledging the importance of Earth Day and taking actions to minimize our carbon footprints, we’re taking strides for a better Earth. After all, we only have one!",
      "author": "mario",
      "id": 3
    },
    {
      "title": "Celebrating International Day of Education",
      "body": "January 24, 2022 is the fourth annual International Day of Education. The United Nations declared this day to celebrate the power of education in bringing peace and development to nations and communities around the world. It is also an opportunity to bring to the forefront the need for inclusive and equitable education that is available to all, including girls and women, and people living in poverty.\nIn Canada, we are so lucky to have powerful, equitable, and accessible education. I have met so many incredible teachers across the country who are passionate about ensuring their students are safe, healthy, and able to learn. They are also fighting to ensure curriculum is unbiased and relevant to the futures of their students. I am grateful to them for creating opportunities to teach relevant and important topics, such as climate change, to students. \n\nIn 2022, the International Day for Education has a specific focus on people coming together through learning to promote inclusion, peace, and sustainability. While all three of these foci are incredible and important, as an environmental educator, I am excited to see a push for education about sustainability. This feels like an incredibly positive opportunity that will provide a space for conservation-based organizations like Sea Smart to work with teachers and inspire students to make positive, lasting changes for the environment. It gives me hope for the positive impact the next generation can learn to have on our shared home, Earth.",
      "author": "yoshi",
      "id": 4
    },
    {
      "title": "Explore The Shore!",
      "body": "Sometimes it can be hard to see what is right under our noses. We go to the shore and play in the sand and the ocean, but how often do we really take the time to sit and just look and explore what is right there around us? \n\nFlip over some rocks (just remember to put them back the way you found them) and see if you can find some crabs – can you tell what species they are, or if they are male or female? As you dig in the sand while building a sandcastle maybe you will feel some little creatures jumping on your hands – these are sand hoppers, a type of crustacean, that like to stay buried in the sand.\n\nDoes the shore look different if you visit at high tide or low tide? (Learn more about tides here). At low tide, the water recedes and uncovers the intertidal zone. Maybe you can see different species of seaweed, or perhaps you will see marine birds wading in the shallows, such as the Great Blue Heron, waiting to catch their next meal. There could be rock pools hiding in the shallows, where small sea creatures are hiding and waiting for the tide to come back in. What can you see along the high tide line? Maybe there are feathers from sea birds, or empty sea shells, sticks and logs or, unfortunately, trash or plastic from human activities that have washed up along the shore (learn how to do a shoreline cleanup here).\n\nHave you ever thought about going to the shore at different times of the day? What do you think you might you see if you go to the shore early in the morning, as the sun is rising and the animals are waking up, before people have come to enjoy the sand and surf? What do you think you might see if you go to the shore in the evening, when the animals are getting ready to go to sleep for the night?\n\nFrom Kitsilano Beach to Jericho and Spanish Banks, all the way across to Ambleside on the North Shore, and Deep Cove in Indian Arm, Metro Vancouver’s urban shores offer so many different habitats – sandy beaches, intertidal mud flats, rocky shores, and so much more! \n\nWould you like to learn more about the species that live on our local Vancouver shores? Why not join Sea Smart’s Explore The Shore Challenge? You can spend anywhere from five minutes to 45 minutes exploring and learning more about your local shores (or longer if you want). The challenge includes downloadable and printable package that has 30 challenges to do, as well as 10 location-specific challenges. Plus you can win great prizes by taking part, as long as you sign up and take part by September 30th, 2021. It is a great way to get the whole family outside and engaged with nature. When you take the time to really stop and observe everything that is going on around you when you are at the shore, you will be amazed at what you can discover! \n\nYou can also check out Sea Smart’s free resources to help families learn more about their local shorelines. Download, print and use these resources whenever it works for you.",
      "author": "mario",
      "id": 5
    },
    {
      "title": "Guest Blog: A Closer Look at Netflix Documentary Seaspiracy",
      "body": "The destruction of marine life and habitats is real, and it is a global issue.\n\nThus, I watched Seaspiracy, the latest controversial documentary produced by Kip Andersen and directed by Ali Tabrizi, with a sense of anticipation at seeing some of today’s biggest ocean issues highlighted to a massive Netflix audience. My sense of anticipation rapidly gave way to annoyance as “old” topics were re-hashed and viewers were subjected to a haphazard and superficial introduction to issue after issue, none of which were properly investigated. My impatience surfaced as I waited for new information or ideas to be raised and my skepticism came out in force at some of the facts and figures being bandied about and presented in an over-simplified manner.\n\nI was enormously surprised that climate change got barely a mention and left unimpressed with the one-sided arguments presented, the bullying tactics of the interviewers, and the naïve approach taken to the entire documentary. I finished Seaspiracy no wiser, frustrated at the weak and simplistic final message to ‘stop eating fish’, appalled at the perpetuation of certain ethnic stereotypes, yet also pleased that some of the issues facing our oceans are finally garnering some well-deserved attention by a mainstream audience.\n\nWHAT SEASPIRACY DID WELL\nOne certainly cannot critique the efforts made by this team to highlight some major ocean issues – over-fishing, plastic pollution, and human slavery. The Seaspiracy team has indeed managed to pinpoint some key ocean issues, and they have managed to get people talking about these issues. But that, unfortunately, is where I leave off this section.\n\nWHAT SEASPIRACY DIDN’T DO WELL\nUnfortunately, while touching on some of the big ocean issues – because no one can deny humans are over-exploiting marine resources and harming oceans – Seaspiracy took only a superficial look at the complex and interwoven social, economic, environmental, and political narratives that contribute to over-fishing, plastic pollution, and human slavery. Trying to pin the ill-health of many ocean systems and species on a single cause is simplistic and naïve, and yet that is what director Tabrizi tries to do, blaming it all on over-fishing.\n\nHe races viewers through plastic pollution, illegal whaling, tuna fishing, shark finning, over-fishing, human slavery aboard fishing vessels, to the indiscriminate critique of sustainable seafood labels, before returning to over-fishing as the single biggest cause of declining ocean health. Any one of those topics was worthy of a documentary in and of itself.\n\nThe Seaspiracy team created greater drama by using simplistic – or simply inaccurate – interpretations of scientific terms, data, and statistics. For example, they confuse and misuse the terms bycatch and discards, and thereby present numbers that are inaccurate, and to a non-marine educated audience, staggeringly high. Climate change is largely ignored, while the contribution of land-based plastic pollution to our oceans is downplayed, and instead lost or discarded fishing gear (known as ghost gear) is blamed. \n\nHowever, that is not to say that plastic is not a huge issue in our oceans – it is – but the root causes of this pollution need to be addressed (stopping plastic pollution at its source), rather than simply focusing on one piece – ghost gear – that conveniently supports the rest of the documentary.\n\n In critiquing one ecolabel, unfortunately, all ecolabels/sustainable seafood labels become lumped under one identity, sowing distrust among consumers and in one foul swoop casting doubt on many trusted sustainable seafood labels (for instance, take a look at Ocean Wise’s Sustainable Seafood label for an example of a trusted, scientifically reputable, evidence-based ecolabel that helps consumers to make ocean-friendly choices). Most sustainable seafood labels go to extreme lengths to ensure the seafood they give a sustainability accreditation to really deserve it.\n\nConservation organizations have historically consisted mainly of privileged white people who believe they are “doing good” by viewing the world through their own narrow lens of experience. This documentary, unfortunately, does little to address this stereotype, but instead goes even further to villainize and promote anti-Asian sentiments (for example, the Japanese fishermen killing dolphins; seafood markets in Hong Kong; commercial Asian-owned and crewed fishing boats), while the white heroes sail to the rescue. It ignores the many people living in Asian countries who also fight daily against over-fishing and slavery, putting their lives at risk.\n\nIt is also with this lens of white privilege that the final message is flung at us – stop eating fish. This message totally ignores that the majority of people in this world do not have the financial means to make such dietary choices. It ignores the centuries-long reliance of many peoples on the oceans for food and cultural connectedness. It ignores that small-scale fisheries can – and have been for centuries – sustainable. It ignores the huge subsidies given to industrial fishing from governments. It ignores that many governments and NGOs are working hard to properly manage commercial fishing stocks to prevent over-fishing and address plastic pollution.\n\nBut it did get us talking about some major ocean issues. It heightened our awareness of the detrimental effects of improperly managed, illegal, unregulated, and destructive fishing practices. It made us take a closer look at plastic pollution, even if the focus was only on ghost gear. And it highlighted inequities and inequalities in fishing, associated industries, and conservation. Now we we need to act on that information to effect positive change.\n\nHOW CAN YOU HELP?\nLearn more about plastic pollution in our oceans by listening to Sea Smart’s short “Ocean Trash Talk” and make use of the many free resources available for the classroom to teach about ocean plastic pollution\n\n.Choose to only consume seafood that has a trusted sustainable seafood label, such as Ocean Wise’s Sustainable Seafood, as indicated on restaurants and seafood packaging.\n\nSupport NGOs that are working in ocean conservation, by learning about what they do, volunteering with them, or donating to help them further their work.",
      "author": "yoshi",
      "id": 6
    },
    {
      "title": "Spooky Sustainability Tips for Halloween 2022",
      "body": "The pandemic has had both positive and negative effects on our environment. On one hand, fewer employees commuting to work reduced emissions created by traffic, but the use of disposable masks and gloves increased the amount of litter found in parks and city streets. \n\nWe can’t completely avoid creating garbage but we can reduce the amount of waste that goes to the landfill by creating sustainable traditions in other aspects of our lives - like Halloween festivities! \n\nHere are a few creative tips to improve the sustainability of your Halloween habits! \nDonate your Jack O’ Lantern to feed farm animals \nWhen food and other organic materials end up in landfills they don’t biodegrade. Instead, they create methane that contributes to global warming. That’s why it’s important to separate organic materials into your organic bin! \n\nAfter Halloween, your pumpkin can be given to a local farm, zoo, or animal sanctuary for the animals to snack on (always check ahead to see if donations are accepted). ",
      "author": "mario",
      "id": 7
    },
    {
      "title": "12 Most Polluted Rivers In The World",
      "body": "Rivers are a critical part of our ecosystem; they not only provide drinking water to billions of people, but are also homes to our precious wildlife. However, pollution at global scale, such as the release of industrial, urban and agricultural wastes, has substantially harmed the river ecosystem and threatened the access to clean drinking water. Furthermore, polluted rivers flowing into the ocean can create even far-reaching impacts. \n\nHere are the top 12 most polluted rivers in the world.",
      "author": "yoshi",
      "id": 8
    }
  ]
}